app/controllers/sessions_controller.rb

  def create
    if auth_hash = request.env['omniauth.auth']
			@user = User.create_with_omniauth(auth_hash)
			session[:user_id] = @user.id
			redirect_to root_path
		else
			@user = User.find_by(:name => params[:user][:name])
---
INSERT INTO "users" ("name", "email", "password_digest", "uid", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", ""], ["LIMIT", 1]]